In [232]:
import pandas as pd
import numpy as np

In [233]:
data_act = pd.read_csv('../../data_sql/actor.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [234]:
data_act.describe()

         actor_id
count  200.000000
mean   100.500000
std     57.879185
min      1.000000
25%     50.750000
50%    100.500000
75%    150.250000
max    200.000000

In [235]:
data_act.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [236]:
data_act.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [237]:
data_act.shape

(200, 4)

In [238]:
data_act.drop_duplicates().shape == data_act.shape

True

In [239]:
pd.unique(data_act['actor_id'])

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200], dtype=int64)

In [240]:
data_act.drop('last_update', axis = 1, inplace = True)

In [241]:
data_act.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [242]:
data_cat = pd.read_csv('../../data_sql/category.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [243]:
data_cat.describe()

       category_id
count    16.000000
mean      8.500000
std       4.760952
min       1.000000
25%       4.750000
50%       8.500000
75%      12.250000
max      16.000000

In [244]:
data_cat.columns

Index(['category_id', 'name', 'last_update'], dtype='object')

In [245]:
data_cat

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [246]:
pd.unique(data_cat['category_id'])

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16],
      dtype=int64)

In [247]:
data_cat.drop('last_update', axis = 1, inplace = True)

In [248]:
data_cat

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [249]:
data_film = pd.read_csv('../../data_sql/film.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [250]:
data_film.shape

(1000, 13)

In [251]:
data_film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [252]:
data_film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [253]:
data_film['last_update'].value_counts()

last_update
2006-02-15 05:03:42    1000
Name: count, dtype: int64

In [254]:
data_film.drop('last_update', axis = 1, inplace = True)
data_film.drop('release_year', axis = 1, inplace = True)
data_film.drop('original_language_id', axis = 1, inplace = True)

In [255]:
data_film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

In [256]:
data_inv = pd.read_csv('../../data_sql/inventory.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [257]:
data_inv.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [258]:
data_inv.drop('last_update', axis = 1, inplace = True)

In [259]:
data_inv.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [260]:
data_lan = pd.read_csv('../../data_sql/language.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [261]:
data_lan.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [262]:
data_lan.drop('last_update', axis = 1, inplace = True)

In [263]:
data_lan.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

In [264]:
data_old = pd.read_csv('../../data_sql/old_HDD.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [265]:
data_old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [266]:
data_old.drop('release_year', axis = 1, inplace = True)

In [267]:
data_old.head()

  first_name last_name                  title  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS            2
2   PENELOPE   GUINESS            ANGELS LIFE           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10
4   PENELOPE   GUINESS          CHEAPER CLYDE           14

In [268]:
data_rent = pd.read_csv('../../data_sql/rental.csv', encoding = 'utf-8', encoding_errors = 'ignore')

In [269]:
data_rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [270]:
data_rent.drop('last_update', axis = 1, inplace = True)

In [271]:
data_rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [272]:
#data_film['film_id']

In [273]:
#data_inv['film_id']

In [274]:
#data_inv['inventory_id']

In [275]:
data_old.tail()

    first_name last_name              title  category_id
995     GOLDIE     BRODY  COMANCHEROS ENEMY            3
996     GOLDIE     BRODY    DAISY MENAGERIE           14
997     GOLDIE     BRODY    DESERT POSEIDON           11
998     GOLDIE     BRODY     EVERYONE CRAFT            9
999     GOLDIE     BRODY     EXORCIST STING           15

In [276]:
# Establecemos la opcin max_rows para todo el dataframe
#pd.set_option('display.max_rows', None)

In [277]:
data_rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [278]:
import mysql.connector as conn

In [279]:
conexion = conn.connect(host='localhost',
                        user='root',
                        passwd='J739242d',
                        database='publications')

cursor = conexion.cursor()

In [280]:
cursor.execute('show tables;')

In [281]:
data_act.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

In [282]:
data_film.iloc[0:223].tail(10)

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
213,214,DAUGHTER MADIGAN,A Beautiful Tale of a Hunter And a Mad Scienti...,1,3,4.99,59,13.99,PG-13,Trailers
214,215,DAWN POND,A Thoughtful Documentary of a Dentist And a Fo...,1,4,4.99,57,27.99,PG,"Trailers,Deleted Scenes,Behind the Scenes"
215,216,DAY UNFAITHFUL,A Stunning Documentary of a Composer And a Mad...,1,3,4.99,113,16.99,G,"Trailers,Commentaries,Deleted Scenes,Behind th..."
216,217,DAZED PUNK,A Action-Packed Story of a Pioneer And a Techn...,1,6,4.99,120,20.99,G,"Commentaries,Deleted Scenes"
217,218,DECEIVER BETRAYED,A Taut Story of a Moose And a Squirrel who mus...,1,7,0.99,122,22.99,NC-17,"Trailers,Commentaries,Deleted Scenes,Behind th..."
218,219,DEEP CRUSADE,A Amazing Tale of a Crocodile And a Squirrel w...,1,6,4.99,51,20.99,PG-13,"Commentaries,Behind the Scenes"
219,220,DEER VIRGINIAN,A Thoughtful Story of a Mad Cow And a Womanize...,1,7,2.99,106,13.99,NC-17,Deleted Scenes
220,221,DELIVERANCE MULHOLLAND,A Astounding Saga of a Monkey And a Moose who ...,1,4,0.99,100,9.99,R,Deleted Scenes
221,222,DESERT POSEIDON,A Brilliant Documentary of a Butler And a Fris...,1,4,4.99,64,27.99,R,"Trailers,Behind the Scenes"
222,223,DESIRE ALIEN,A Fast-Paced Tale of a Dog And a Forensic Psyc...,1,7,2.99,76,24.99,NC-17,Deleted Scenes

In [283]:
data_rent.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [284]:
data_act = data_act.to_csv('../../data_sql_modif/data_act', index = False)
data_cat = data_cat.to_csv('../../data_sql_modif/data_cat', index = False)
data_film = data_film.to_csv('../../data_sql_modif/data_film', index = False)
data_inv = data_inv.to_csv('../../data_sql_modif/data_inv', index = False)
data_lan = data_lan.to_csv('../../data_sql_modif/data_lan', index = False)
data_old = data_old.to_csv('../../data_sql_modif/data_old', index = False)
data_rent = data_rent.to_csv('../../data_sql_modif/data_rent', index = False)